libxmlbus/data/wsaddr-testset/documents/echo/soap11/duplicateReplyToRequest.xml

<?xml version="1.0"?>
<!-- $Id: duplicateReplyToRequest.xml,v 1.6 2006/02/20 16:01:17 pdowney Exp $ -->
<soap11:Envelope xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <soap11:Header>
    <wsa:To>http://example.org/node/A</wsa:To>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:MessageID>urn:uuid:A4A96CCF-8366-4724-88E6-56BB9926CB35</wsa:MessageID>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
    </wsa:ReplyTo>
  </soap11:Header>
  <soap11:Body>
    <m:echoIn xmlns:m="http://example.org/echo">Echo This Text</m:echoIn>
  </soap11:Body>
</soap11:Envelope>
